<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 安装程序配置文件
 */
return array(
    //产品配置
    'install_product_name'   => 'snake_', //产品名称
    'install_website_domain' => 'http://www.baiyf.com/snake', //官方网址
    'install_company_name'   => 'snake通用后台', //公司名称
    'original_table_prefix'  => 'snake_', //默认表前缀

    // 安装配置
    'install_table_total' => 28, // 安装时，需执行的sql语句数量
);
